app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]  #limit cart destruction. can only delete cart if it is a cookie in your browser