app/controllers/line_items_controller.rb

  def create
    session[:counter] = 0
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 644331355]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-02-26 04:09:49.109461"], ["updated_at", "2016-02-26 04:09:49.109461"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 644331355], ["cart_id", 980190963], ["created_at", "2016-02-26 04:09:49.113505"], ["updated_at", "2016-02-26 04:09:49.113505"]]