app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-18 02:47:25.962595"], ["updated_at", "2016-03-18 02:47:25.962595"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jeremy Perkins"], ["address", "MyText"], ["email", "dave@example.org"], ["pay_type", "Check"], ["created_at", "2016-03-18 02:47:25.980508"], ["updated_at", "2016-03-18 02:47:25.980508"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])