app/views/store/index.html.erb

<h2>You have visited this page &times<%= @counter %> times</h2>
<% cache ['store', Product.latest] do %>
---
SELECT  "products".* FROM "products"  ORDER BY "products"."updated_at" DESC LIMIT 1